OpenFOAM_12_cases/catalystHeatUp/constant/SCR1/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.org                      |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType constSolidThermo;

rho
{
    // 100 percent solid -> rho 2650
    // 10 percent solid (porous assumption) -> rho 265
    type            uniform;
    value           265;
}

Cv
{
    // Cp - Cv = R / M
    type            uniform;
    value           605.56;
}

kappa
{
    type            uniform;
    value           2;
}


// ************************************************************************* //
